bin/retrieveRequest.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
	xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Header>
        <n1:SessionHeader xmlns:n1="http://soap.sforce.com/2006/04/metadata">
            <n1:sessionId>sessionIdVar</n1:sessionId>
        </n1:SessionHeader>
    </env:Header>
    <env:Body>
        <n1:retrieve xmlns:n1="http://soap.sforce.com/2006/04/metadata">
            <n1:retrieveRequest type="tns:RetrieveRequest">
                <n1:apiVersion type="xsd:double">apiVersionVar</n1:apiVersion>
                <n1:singlePackage type="xsd:boolean">TRUE</n1:singlePackage>
                <n1:unpackaged type="tns:Package">
                    <types> 
                        <members>*</members>
                        <name>typeNameVar</name>
                    </types>
                    <version>apiVersionVar</version>
                </n1:unpackaged>
            </n1:retrieveRequest>
        </n1:retrieve>
    </env:Body>
</env:Envelope>
